{"pages":[{"title":"","text":"google-site-verification: google9de04b5718a6898d.html","link":"/google9de04b5718a6898d.html"},{"title":"关于","text":"关于我。","link":"/about/index.html"}],"posts":[{"title":"玩一下美团团节社","text":"今天看到美团又推出了一个新项目，叫做“团节社”，名字感觉不错，“团节”应该是取“（拼）团节（省）”之意，同时又是“团结”的谐音。“社”又有“社交电商”的寓意。 还不知道这个项目之后发展如何，但美团的项目通常稳准狠，这个团节社尚在启动期，尽早占个坑，大概率也能收获一波红利。 于是研究了一下，做个笔记： 美团团节社是什么？ 美团在继推出社区团购业务“美团优选”后，即将在多地再推新业务，主打本地社交电商。……美团将推出一个名为“美团团节社”的新项目，主打本地团购特惠秒杀服务，聚合不同种类的商品优惠活动信息，再以文章的形式，通过当地的团节社微信公众号向本地用户推送，让用户进行购买，此外，可能会在当地的团节社微信公众号内嵌入“团节社”秒杀平台，用户可以通过在文内扫码或者点击小程序的方式进行跳转。其运营模式与身为其直接竞品的本地生活团购产品“联联周边游”相似。—— 美团即将推出“美团团节社”，布局社交电商 团节社的产品还没有正式上线，所以看不到具体的形态，但既然对标“联联周边游”，业务应该也差不多。 联联周边游口碑不怎么样，提供低价旅游服务和产品，但市场规模不小（看来还是穷人多）。 如何注册美团团节社达人？微信扫这个码，即可注册为团节社达人。 用美团团节社怎么赚钱？和其它推广获佣项目差不多，等团节社平台正式上线后，推广上面的产品，获取佣金即可。","link":"/p/190889952/"},{"title":"简单生活准则","text":"两年前，我发现了一个能让自己瞬间变幸福的方法：扔东西。 不是在开玩笑，这里的「东西」是泛指：删掉所有非必须的 App、扔掉不会再看的书、清除那些已经想不起来是谁的联系人…… 这些事儿都能让你感觉到清空内存般畅快，绝对超过你想象的程度。 我以前不舍得扔东西，常觉得「这个没准儿以后还用得着呢」，或是「这个当时买的时候挺贵的，还是留着吧」，结果攒了一堆没用的东西，不但占了物理上的空间，而重要的是在我的「心理内存」中占据了大量空间（这个词是我杜撰的，但你应该懂我的意思），直到把它们都清空后，我才意识到当初浪费有多么巨大。 此后的几年，在总体生活成本没有提高的情况下，我的幸福感比以前高了好几倍，于是我开始以此为基点，发展我自己的「极简生活准则」，这个轻单就是我总结的要点，如果喜欢，你也可以试试。","link":"/p/1243066710/"},{"title":"浮光掠影走美国","text":"因故出行美国一周，旧金山进纽约出，时间太紧张，无暇深度感受，只能草草记下一些浅显的印象。 从北京出发，去程选择了美联航直飞旧金山，对美国航空公司的服务早有耳闻，但心中尚存一丝侥幸，觉得未必真有那么不堪。但登机之后，心彻底凉了，美联航的服务给我的整体感受，是一种破罐子破摔的状态。 令人心生敬意的机龄首先是飞机旧，我们这架已经16年机龄，机舱里随处可见岁月的痕迹。事实证明，老而弥坚是不存在的，这架飞机没有辜负它的年龄，在连续宣布两次推迟起飞之后，终于正式确定此次航班被取消了，原因没有公布，但据听到机组内部讨论的乘客说，可能是检查时发现引擎有问题。 Shit！我的第一天行程全部被打乱，约好的人要重新约、酒店恰好定的是不可改期不可退款的…… 更讨厌的是，本来就紧张的时间，又强行被砍掉一天。 无比烦躁中下机前往航空公司安排的酒店，却发现旁边几个转机的东南亚妹子欢天喜地，对她们这种什么都比时间更贵重的年龄来说，平白多了一晚在北京玩，又有人免费承担五星级酒店和两顿饭，遇到航班取消简直像中了彩票一样幸运。 第二天重新登机，查了航班管家，欣慰的发现换了一架飞机，但高兴不过两秒，就看到这架的机龄是 22 年…… 这公司真的没有更年轻的飞机了么？！ 好在这次没有再出什么幺蛾子，至于又被推迟起飞近一个小时这种小事，几乎都没人为此感到不爽。 和空服人员的年龄比起来，飞机的年龄就显得很小了。 我说「空服」而不说「空姐」，是因为她们如果站在国内那些航空公司的空姐面前，是必须被称为「阿姨」甚至「奶奶」的。当然，我知道在长途的国际航线中，欧美航空公司多半配备中老年为主的服务团队（详情可参阅这个知乎问题），但十几个小时的漫长飞行，总还是要赏心悦目些才更好。 更何况年龄大未必意味着服务更好，我遇到的这几个大龄空姐和空爷，服务就很是牵强，首先服装都不统一，只有最外面的蓝马甲是制服，裤子和里面的衬衫则是各穿各的，格子条纹浅色深色，什么都有，一眼看去很难分清谁是空服谁是乘客。 其次服务方式、和乘客的交流方式也各不相同，每个人都有自己的风格，唯一相似的地方是同样死气沉沉，以及满脸的不耐烦，让乘客深刻的体会到他们也和我们一样在忍受长途飞行的煎熬。只有一个大概50多岁的空乘大爷比较开朗，常给两位年轻漂亮的中国女乘客额外拿些吃的，还愿意克服疲惫和她们谈笑风生。 上上下下的旧金山熬过了一夜，顺利飞到旧金山，不巧那天多云，飞机在云层之上还是晴空万里，落到地面时就灰蒙蒙的，完全看不到我心目中明媚的加州阳光。 （未完……）","link":"/p/1487346013/"},{"title":"目前国内比较好的TTS(语音合成)接口","text":"想在播客里加一个小功能：每天自动播报几条科技新闻。新闻来源可以通过一些接口抓取再筛选，但用真人来读成本实在太高，TTS（语音合成）如果可行，当然是比较完美的方案。大概5年前试过科大讯飞的TTS接口，当时感觉效果还不错，但用于正式的内容类产品中仍略显牵强。 5年过去了，国内的TTS水平会不会已经突飞猛进？有点期待，于是简单测试了一下，总体感受没有期待中那么大进步，用于阅读新闻等场景仍然不太理想，目前比较适合的可能还是读验证码、简短的语音提示等场景。 分别说说试过的几个接口，由于我的需求是在服务器端生成语音文件，所以测试的都是在线调用的Web接口，不是App里的SDK： 科大讯飞网址： 讯飞开放平台-在线语音合成 合成多音字、静音停顿、数字读法 优点： 精品发音人的效果比较好，其中“讯飞晓峰”比较适合播报严肃新闻 对多音字、静音停顿、数字、英文读法等提供了控制标记，比如： 着[=zhuo2]手：多音字“着”在这里读为zhuó 你好[p500]科大讯飞：静音停顿500毫秒 [n2]123[n1]456[n0]：123将会按照数值处理，读成“一百二十三”，456则会按照号码处理，读成“四五六”，其后出现的数字，则会自动判断读法 缺点： 接口有每日调用次数限制，默认500次，可申请调至2万次/天，听起来不少，可实际调用时每次不能请求太长的文本，需要拆分，如果需要生成的内容比较多，还是有可能达到上限 免费的普通发音人效果非常差，在新闻阅读的场景中，几乎不可用 精品发音人效果虽然较好，但需要付费使用，年付2万-10万元，对于免费项目来说，这个使用成本比较难接受 腾讯腾讯有好几个团队在提供相关接口，我找到的有三个： 腾讯AI实验室 腾讯优图 腾讯云 其中前两个接口都是在“腾讯AI开放平台”上提供的，可以在这里体验一下生成语音的效果，具体的文档在这里。 腾讯AI实验室接口效果不好，和科大讯飞的普通发音人差不多。 腾讯优图的效果明显好很多，目前又免费试用，且不限制请求次数，本来已经觉得可以选择了，但有一个很难接受的Bug是：无法控制英文的读法。比如对“IT”来说，有时我们希望按照单词的方式，读成“it”，但很多时候，需要按照字母的方式读出“I-T”，如果用科大讯飞的接口，可以用标记来指定想要的读法，但优图并没有提供类似的方式来指定读法，也无法足够智能的判断应该怎么读，不论传给它“it”、“It”，还是“IT”，永远都只会按照单词的方式来读，因此也无法使用。 最后试用的是腾讯云的语音合成API，文档在这里，Python的SDK在这里。 总结测试后发现，综合来说，腾讯云的语音合成接口是目前最适合我的： 优点： 生成效果非常好，个人感受甚至超过科大讯飞需要付费的精品发音人 目前内测阶段免费使用，且无调用次数限制 前面提到优图做不好的英文读法问题，腾讯云可以部分解决：传“it”会按单词读，传“IT”会按字母读 缺点： 无法控制多音字读法、数字读法、英文读法 无法控制停顿（但可以通过切分成多段文本来自己控制） 最终开发此功能时，我会选择使用腾讯云的TTS（语音合成）接口。","link":"/p/2737981892/"}],"tags":[{"name":"美团","slug":"美团","link":"/tags/%E7%BE%8E%E5%9B%A2/"},{"name":"团节社","slug":"团节社","link":"/tags/%E5%9B%A2%E8%8A%82%E7%A4%BE/"},{"name":"旅行","slug":"旅行","link":"/tags/%E6%97%85%E8%A1%8C/"},{"name":"tts","slug":"tts","link":"/tags/tts/"},{"name":"语音识别","slug":"语音识别","link":"/tags/%E8%AF%AD%E9%9F%B3%E8%AF%86%E5%88%AB/"},{"name":"语音识别接口","slug":"语音识别接口","link":"/tags/%E8%AF%AD%E9%9F%B3%E8%AF%86%E5%88%AB%E6%8E%A5%E5%8F%A3/"},{"name":"科大讯飞","slug":"科大讯飞","link":"/tags/%E7%A7%91%E5%A4%A7%E8%AE%AF%E9%A3%9E/"},{"name":"腾讯优图","slug":"腾讯优图","link":"/tags/%E8%85%BE%E8%AE%AF%E4%BC%98%E5%9B%BE/"},{"name":"腾讯云","slug":"腾讯云","link":"/tags/%E8%85%BE%E8%AE%AF%E4%BA%91/"},{"name":"腾讯AI实验室","slug":"腾讯AI实验室","link":"/tags/%E8%85%BE%E8%AE%AFAI%E5%AE%9E%E9%AA%8C%E5%AE%A4/"}],"categories":[]}